InformationRegisters/СвязиОбщейНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбщейНоменклатуры</Name>
			<Comment>Соответствие предопределенной номенклатуры и обычной</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбщаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщаяНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейНаИзготовление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакупОптом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МожетПредоставитьЗаказчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЛистов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяПоСкладу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Розничная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Базовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделитьВНаряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДетали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаДетали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяУслуга</Name>
					<Comment>Используеться для номенклатуры"Щит мебельный"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйЭлемент</Name>
					<Comment>Используеться для номенклатуры"Щит мебельный"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОписаниеСостава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБазовых</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеТекстуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Парковка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоперечнаяТекстура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобертаемОптом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СеткаОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СеткаОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяЗона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦеховыеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаДетали</Name>
					<Comment>Ширина детали</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВБазовых</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеСостава</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ингридиент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЛексСерверПовтИсп/Ext/Module.bsl
Функция ПолучитьОбщуюНоменклатуруПолностью(Подразделение, Коллекция = Неопределено) Экспорт
	
	Данные = Новый Структура();
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
			
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Вариант", ?(ЗначениеЗаполнено(Коллекция), Коллекция.ВариантОбщейНоменклатуры, 1));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Общая.ИмяПредопределенныхДанных КАК ОбщаяНоменклатураИмя,
		|	ВЫБОР
		|		КОГДА &Вариант = 0
		|				ИЛИ &Вариант = 1
		|			ТОГДА СвязиОбщейНоменклатуры.Номенклатура
		|		КОГДА &Вариант = 2
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура2 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура2
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|		КОГДА &Вариант = 3
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура3 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура3
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|		КОГДА &Вариант = 4
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура4 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура4
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|	КОНЕЦ КАК Номенклатура
		|ИЗ
		|	Справочник.ОбщаяНоменклатура КАК Общая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиОбщейНоменклатуры КАК СвязиОбщейНоменклатуры
		|		ПО Общая.Ссылка = СвязиОбщейНоменклатуры.ОбщаяНоменклатура
		|			И (СвязиОбщейНоменклатуры.Подразделение = &Подразделение)
		|ГДЕ
		|	НЕ Общая.ПометкаУдаления
		|	И НЕ Общая.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Общая.Наименование";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				  Данные.Вставить(Выборка.ОбщаяНоменклатураИмя,Выборка.Номенклатура);
			КонецЦикла;
		
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните подразделение.");
		
	КонецЕсли;
		
	Возврат Данные;
	
КонецФункции

Функция ПолучитьОбщуюНоменклатуру(ОбщаяНоменклатура, Подразделение, Коллекция = Неопределено) Экспорт

	Номенклатура = Неопределено;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
			
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("ОбщаяНоменклатура", ОбщаяНоменклатура);
		Запрос.УстановитьПараметр("Вариант", ?(ЗначениеЗаполнено(Коллекция), Коллекция.ВариантОбщейНоменклатуры, 1));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Общая.Ссылка КАК ОбщаяНоменклатура,
		|	ВЫБОР
		|		КОГДА &Вариант = 0
		|				ИЛИ &Вариант = 1
		|			ТОГДА СвязиОбщейНоменклатуры.Номенклатура
		|		КОГДА &Вариант = 2
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура2 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура2
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|		КОГДА &Вариант = 3
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура3 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура3
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|		КОГДА &Вариант = 4
		|			ТОГДА ВЫБОР
		|					КОГДА СвязиОбщейНоменклатуры.Номенклатура4 <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА СвязиОбщейНоменклатуры.Номенклатура4
		|					ИНАЧЕ СвязиОбщейНоменклатуры.Номенклатура
		|				КОНЕЦ
		|	КОНЕЦ КАК Номенклатура
		|ИЗ
		|	Справочник.ОбщаяНоменклатура КАК Общая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиОбщейНоменклатуры КАК СвязиОбщейНоменклатуры
		|		ПО Общая.Ссылка = СвязиОбщейНоменклатуры.ОбщаяНоменклатура
		|			И (СвязиОбщейНоменклатуры.Подразделение = &Подразделение)
		|ГДЕ
		|	Общая.Ссылка = &ОбщаяНоменклатура
		|	И НЕ Общая.ПометкаУдаления
		|	И НЕ Общая.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Общая.Наименование";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Номенклатура = Выборка.Номенклатура;
		
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните подразделение.");
		
	КонецЕсли;
		
	Возврат Номенклатура;
	
КонецФункции

Функция ПолучитьРазмерыЛиста(ТекущаяНоменклатура, Подразделение) Экспорт
	
	СтруктураРазмеровЛиста = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.ДлинаДетали, СпрНом.ДлинаДетали) КАК ВысотаЛиста,
	|	ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.ШиринаДетали, СпрНом.ШиринаДетали) КАК ШиринаЛиста,
	|	ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.ДлинаБезТорцовки, СпрНом.ДлинаБезТорцовки) КАК ВысотаЛистаБезТорцовки,
	|	ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.ШиринаБезТорцовки, СпрНом.ШиринаБезТорцовки) КАК ШиринаЛистаБезТорцовки
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО (НастройкиНоменклатуры.Номенклатура = СпрНом.Ссылка)
	|ГДЕ
	|	СпрНом.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяНоменклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураРазмеровЛиста.Вставить("ВысотаЛиста", ВыборкаДетальныеЗаписи.ВысотаЛиста);
		СтруктураРазмеровЛиста.Вставить("ШиринаЛиста", ВыборкаДетальныеЗаписи.ШиринаЛиста);
		СтруктураРазмеровЛиста.Вставить("ВысотаЛистаБезТорцовки", ВыборкаДетальныеЗаписи.ВысотаЛистаБезТорцовки);
		СтруктураРазмеровЛиста.Вставить("ШиринаЛистаБезТорцовки", ВыборкаДетальныеЗаписи.ШиринаЛистаБезТорцовки);

	КонецЦикла;
	
	Возврат СтруктураРазмеровЛиста;
	
КонецФункции

Функция ПоложениеПазовПетли(Расположение) Экспорт
	
	Возврат Расположение.ПоложениеПазов; 
	
КонецФункции
